Using cuda
====================================================================================================
Layer (type:depth-idx)                             Output Shape              Param #
====================================================================================================
Transformer                                        [1, 100, 1]               --
├─Linear: 1-1                                      [1, 100, 32]              384
├─Time2Vec: 1-2                                    [1, 100, 40]              --
│    └─Linear: 2-1                                 [100, 8]                  16
├─Linear: 1-3                                      [1, 100, 32]              (recursive)
├─Time2Vec: 1-4                                    [1, 100, 40]              (recursive)
│    └─Linear: 2-2                                 [100, 8]                  (recursive)
├─Transformer: 1-5                                 [1, 100, 40]              --
│    └─MyIdentity: 2-3                             [1, 100, 40]              --
│    └─TransformerDecoder: 2-4                     [1, 100, 40]              --
│    │    └─ModuleList: 3-1                        --                        95,952
│    │    └─LayerNorm: 3-2                         [1, 100, 40]              80
├─Sequential: 1-6                                  [1, 100, 1]               --
│    └─Linear: 2-5                                 [1, 100, 20]              820
│    └─Dropout: 2-6                                [1, 100, 20]              --
│    └─ReLU: 2-7                                   [1, 100, 20]              --
│    └─Linear: 2-8                                 [1, 100, 1]               21
├─Sigmoid: 1-7                                     [1, 100, 1]               --
====================================================================================================
Total params: 97,273
Trainable params: 97,273
Non-trainable params: 0
Total mult-adds (M): 0.02
====================================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 1.03
Params size (MB): 0.07
Estimated Total Size (MB): 1.12
====================================================================================================
