Using cuda
====================================================================================================
Layer (type:depth-idx)                             Output Shape              Param #
====================================================================================================
Transformer                                        [1, 200, 1]               --
├─Sequential: 1-1                                  [1, 200, 64]              --
│    └─Linear: 2-1                                 [1, 200, 64]              320
│    └─PositionalEncodingStandard: 2-2             [1, 200, 64]              --
├─Sequential: 1-2                                  [1, 200, 64]              (recursive)
│    └─Linear: 2-3                                 [1, 200, 64]              (recursive)
│    └─PositionalEncodingStandard: 2-4             [1, 200, 64]              --
├─Transformer: 1-3                                 [1, 200, 64]              --
│    └─MyIdentity: 2-5                             [1, 200, 64]              --
│    └─TransformerDecoder: 2-6                     [1, 200, 64]              --
│    │    └─ModuleList: 3-1                        --                        41,984
│    │    └─LayerNorm: 3-2                         [1, 200, 64]              128
├─Sequential: 1-4                                  [1, 200, 1]               --
│    └─Linear: 2-7                                 [1, 200, 32]              2,080
│    └─Dropout: 2-8                                [1, 200, 32]              --
│    └─ReLU: 2-9                                   [1, 200, 32]              --
│    └─Linear: 2-10                                [1, 200, 1]               33
├─Sigmoid: 1-5                                     [1, 200, 1]               --
====================================================================================================
Total params: 44,545
Trainable params: 44,545
Non-trainable params: 0
Total mult-adds (M): 0.01
====================================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.87
Params size (MB): 0.05
Estimated Total Size (MB): 0.92
====================================================================================================
Epoch 1 / 300, train loss: 0.6974491477012634
Epoch 1 / 300, val loss: 0.6967710256576538
Epoch 1 / 300, val acc: 0.48160192370414734
Epoch 2 / 300, train loss: 0.6882668137550354
Epoch 2 / 300, val loss: 0.6949818134307861
Epoch 2 / 300, val acc: 0.4905491769313812
Epoch 3 / 300, train loss: 0.6942773461341858
Epoch 3 / 300, val loss: 0.69523024559021
Epoch 3 / 300, val acc: 0.4891904294490814
Epoch 4 / 300, train loss: 0.6954843401908875
Epoch 4 / 300, val loss: 0.6944526433944702
Epoch 4 / 300, val acc: 0.49930593371391296
Epoch 5 / 300, train loss: 0.6913660168647766
Epoch 5 / 300, val loss: 0.6930260062217712
Epoch 5 / 300, val acc: 0.5140327215194702
Epoch 6 / 300, train loss: 0.6908251643180847
Epoch 6 / 300, val loss: 0.6927321553230286
Epoch 6 / 300, val acc: 0.5221123695373535
