Using cuda
====================================================================================================
Layer (type:depth-idx)                             Output Shape              Param #
====================================================================================================
Transformer                                        [1, 200, 1]               --
├─Sequential: 1-1                                  [1, 200, 64]              --
│    └─Linear: 2-1                                 [1, 200, 64]              320
│    └─PositionalEncodingLearned: 2-2              [1, 200, 64]              --
│    │    └─Sequential: 3-1                        [15000, 64]               8,320
│    │    └─Dropout: 3-2                           [1, 200, 64]              --
├─Sequential: 1-2                                  [1, 200, 64]              (recursive)
│    └─Linear: 2-3                                 [1, 200, 64]              (recursive)
│    └─PositionalEncodingLearned: 2-4              [1, 200, 64]              (recursive)
│    │    └─Sequential: 3-3                        [15000, 64]               (recursive)
│    │    └─Dropout: 3-4                           [1, 200, 64]              --
├─Transformer: 1-3                                 [1, 200, 64]              --
│    └─TransformerEncoder: 2-5                     [1, 200, 64]              --
│    │    └─ModuleList: 3-5                        --                        50,432
│    │    └─LayerNorm: 3-6                         [1, 200, 64]              128
│    └─TransformerDecoder: 2-6                     [1, 200, 64]              --
│    │    └─ModuleList: 3-7                        --                        83,968
│    │    └─LayerNorm: 3-8                         [1, 200, 64]              128
├─Sequential: 1-4                                  [1, 200, 1]               --
│    └─Linear: 2-7                                 [1, 200, 32]              2,080
│    └─Dropout: 2-8                                [1, 200, 32]              --
│    └─ReLU: 2-9                                   [1, 200, 32]              --
│    └─Linear: 2-10                                [1, 200, 1]               33
├─Identity: 1-5                                    [1, 200, 1]               --
====================================================================================================
Total params: 145,409
Trainable params: 145,409
Non-trainable params: 0
Total mult-adds (M): 249.62
====================================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 32.21
Params size (MB): 0.11
Estimated Total Size (MB): 32.33
====================================================================================================
