Using cuda
====================================================================================================
Layer (type:depth-idx)                             Output Shape              Param #
====================================================================================================
Transformer                                        [1, 200, 1]               --
├─Linear: 1-1                                      [1, 200, 64]              320
├─Time2Vec: 1-2                                    [1, 200, 68]              --
│    └─Linear: 2-1                                 [200, 4]                  8
├─Linear: 1-3                                      [1, 200, 64]              (recursive)
├─Time2Vec: 1-4                                    [1, 200, 68]              (recursive)
│    └─Linear: 2-2                                 [200, 4]                  (recursive)
├─Transformer: 1-5                                 [1, 200, 68]              --
│    └─TransformerEncoder: 2-3                     [1, 200, 68]              --
│    │    └─ModuleList: 3-1                        --                        139,380
│    │    └─LayerNorm: 3-2                         [1, 200, 68]              136
│    └─TransformerDecoder: 2-4                     [1, 200, 68]              --
│    │    └─ModuleList: 3-3                        --                        233,900
│    │    └─LayerNorm: 3-4                         [1, 200, 68]              136
├─Sequential: 1-6                                  [1, 200, 1]               --
│    └─Linear: 2-5                                 [1, 200, 34]              2,346
│    └─Dropout: 2-6                                [1, 200, 34]              --
│    └─ReLU: 2-7                                   [1, 200, 34]              --
│    └─Linear: 2-8                                 [1, 200, 1]               35
├─Identity: 1-7                                    [1, 200, 1]               --
====================================================================================================
Total params: 376,261
Trainable params: 376,261
Non-trainable params: 0
Total mult-adds (M): 0.05
====================================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 3.18
Params size (MB): 0.20
Estimated Total Size (MB): 3.38
====================================================================================================
